In [9]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame({
    
    'age':[12,12,15,47],
    'weight':[22.2,55.6,78.9,88.88],
    'height':[1.72,1.74,1.91,1.54]


})

df

   age  weight  height
0   12   22.20    1.72
1   12   55.60    1.74
2   15   78.90    1.91
3   47   88.88    1.54

In [11]:
df.loc[2,'weight'] = np.nan

In [12]:
df

   age  weight  height
0   12   22.20    1.72
1   12   55.60    1.74
2   15     NaN    1.91
3   47   88.88    1.54

In [13]:
df.dropna()

   age  weight  height
0   12   22.20    1.72
1   12   55.60    1.74
3   47   88.88    1.54

In [14]:
df.dropna(how='any',axis=0)

   age  weight  height
0   12   22.20    1.72
1   12   55.60    1.74
3   47   88.88    1.54

In [15]:
df.loc[3,'weight'] = np.nan

In [17]:
df.dropna()

   age  weight  height
0   12    22.2    1.72
1   12    55.6    1.74

In [19]:
df.dropna(how = 'all', axis = 0)

   age  weight  height
0   12    22.2    1.72
1   12    55.6    1.74
2   15     NaN    1.91
3   47     NaN    1.54

In [20]:
# thresh

In [21]:
df.dropna(thresh=3,axis=0)

   age  weight  height
0   12    22.2    1.72
1   12    55.6    1.74

In [22]:
df.dropna(thresh=df.shape[1],axis = 0
         )

   age  weight  height
0   12    22.2    1.72
1   12    55.6    1.74

In [23]:
df.shape

(4, 3)

In [24]:
df.dropna(axis = 1)

   age  height
0   12    1.72
1   12    1.74
2   15    1.91
3   47    1.54

In [25]:
df.dropna(how = 'any',axis = 1)

   age  height
0   12    1.72
1   12    1.74
2   15    1.91
3   47    1.54

In [27]:
df.dropna(how = 'all',axis = 1)

   age  weight  height
0   12    22.2    1.72
1   12    55.6    1.74
2   15     NaN    1.91
3   47     NaN    1.54

In [28]:
df.dropna(axis = 1, thresh = 3)

   age  height
0   12    1.72
1   12    1.74
2   15    1.91
3   47    1.54

In [29]:
# dropna with subset

In [32]:
df['gender'] = ['M','F',np.nan,'M']

In [33]:
df

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F
2   15     NaN    1.91    NaN
3   47     NaN    1.54      M

In [34]:
df.dropna()

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F

In [35]:
df.dropna(axis = 0, how='any')

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F

In [36]:
df.dropna(axis = 0, how = 'any', subset=['gender'])

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F
3   47     NaN    1.54      M

In [37]:
df.dropna(axis = 0, how = 'any', subset=['age'])

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F
2   15     NaN    1.91    NaN
3   47     NaN    1.54      M

In [38]:
df.dropna(axis = 0, how = 'any', subset=['weight'])

   age  weight  height gender
0   12    22.2    1.72      M
1   12    55.6    1.74      F

In [42]:
df.dropna(axis = 1, how = 'any',subset=[0,2])

   age  height
0   12    1.72
1   12    1.74
2   15    1.91
3   47    1.54